Create a new notebook. Then, import the data contained in the file product_sales.csv. Finally:

* display the data content

In [3]:
import pandas as pd

product_sales = pd.read_csv('product_sales.csv')
product_sales

            SaleRep Region  Orders  TotalSales
0      Felice Lunck   West     218       44489
1    Doralynn Pesak   West     233       61035
2  Madelle Martland   East     264       62603
3      Yasmin Myhan  South     110       59377
4   Marmaduke Webbe   East     188       78771
5   Christiano Vero   East     265       68506
6   Cecelia Jealous   West      93       53634
7    Isaak Housiaux   East     189       62455
8    Derril Howland   East     385       73460
9       Judon Allom   West     230       51067

* export data to an html document

In [5]:
product_sales.to_html("product_sales.html")

* display the html document in a web browser

In [7]:
pd.read_html("product_sales.html")

[   Unnamed: 0           SaleRep Region  Orders  TotalSales
 0           0      Felice Lunck   West     218       44489
 1           1    Doralynn Pesak   West     233       61035
 2           2  Madelle Martland   East     264       62603
 3           3      Yasmin Myhan  South     110       59377
 4           4   Marmaduke Webbe   East     188       78771
 5           5   Christiano Vero   East     265       68506
 6           6   Cecelia Jealous   West      93       53634
 7           7    Isaak Housiaux   East     189       62455
 8           8    Derril Howland   East     385       73460
 9           9       Judon Allom   West     230       51067]

* export the first and the last column to a csv file

In [9]:
product_sales.iloc[:,[0,-1]].to_csv("product_sales_two_columns.csv")

* display the csv document in a text editor

In [10]:
pd.read_csv("product_sales_two_columns.csv")

   Unnamed: 0           SaleRep  TotalSales
0           0      Felice Lunck       44489
1           1    Doralynn Pesak       61035
2           2  Madelle Martland       62603
3           3      Yasmin Myhan       59377
4           4   Marmaduke Webbe       78771
5           5   Christiano Vero       68506
6           6   Cecelia Jealous       53634
7           7    Isaak Housiaux       62455
8           8    Derril Howland       73460
9           9       Judon Allom       51067

* export data related to the west region to an html file

In [12]:
product_sales[product_sales["Region"] == "West"].to_html("product_sales_west.html")

* display the content of the html file in a web browser

In [13]:
pd.read_html("product_sales_west.html")

[   Unnamed: 0          SaleRep Region  Orders  TotalSales
 0           0     Felice Lunck   West     218       44489
 1           1   Doralynn Pesak   West     233       61035
 2           6  Cecelia Jealous   West      93       53634
 3           9      Judon Allom   West     230       51067]